In [3]:
import numpy as np
import pandas as pd

In [4]:
df=pd.DataFrame({"Value 1":[100,np.nan, 234,np.nan], 
                "Value 2":[300,121,np.nan,np.nan],
                "Value 3":["abc","xyz","lmn","pqr"]})

In [5]:
df

   Value 1  Value 2 Value 3
0    100.0    300.0     abc
1      NaN    121.0     xyz
2    234.0      NaN     lmn
3      NaN      NaN     pqr

In [6]:
df.isnull()

   Value 1  Value 2  Value 3
0    False    False    False
1     True    False    False
2    False     True    False
3     True     True    False

In [8]:
df.isnull().sum()

Value 1    2
Value 2    2
Value 3    0
dtype: int64

In [9]:
df.fillna(df.mean(),inplace=True)

C:\Users\sharan\AppData\Local\Temp\ipykernel_31348\2085774198.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean(),inplace=True)

In [10]:
df

   Value 1  Value 2 Value 3
0    100.0    300.0     abc
1    167.0    121.0     xyz
2    234.0    210.5     lmn
3    167.0    210.5     pqr

In [11]:
df.mean()

C:\Users\sharan\AppData\Local\Temp\ipykernel_31348\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Value 1    167.0
Value 2    210.5
dtype: float64

In [13]:
df.sort_values(by="Value 1",ascending=False)

   Value 1  Value 2 Value 3
2    234.0    210.5     lmn
1    167.0    121.0     xyz
3    167.0    210.5     pqr
0    100.0    300.0     abc

In [25]:
mn={"one":[1,2,3,4,5],
   "two":[6,7,8,9,10],
   "letter":["a","b","c","d","e"]}

In [26]:
mn

{'one': [1, 2, 3, 4, 5],
 'two': [6, 7, 8, 9, 10],
 'letter': ['a', 'b', 'c', 'd', 'e']}

In [27]:
cd=pd.DataFrame(mn)

In [28]:
cd

   one  two letter
0    1    6      a
1    2    7      b
2    3    8      c
3    4    9      d
4    5   10      e

In [29]:
new_df=pd.concat([df,cd])

In [30]:
new_df

   Value 1  Value 2 Value 3  one   two letter
0    100.0    300.0     abc  NaN   NaN    NaN
1    167.0    121.0     xyz  NaN   NaN    NaN
2    234.0    210.5     lmn  NaN   NaN    NaN
3    167.0    210.5     pqr  NaN   NaN    NaN
0      NaN      NaN     NaN  1.0   6.0      a
1      NaN      NaN     NaN  2.0   7.0      b
2      NaN      NaN     NaN  3.0   8.0      c
3      NaN      NaN     NaN  4.0   9.0      d
4      NaN      NaN     NaN  5.0  10.0      e

In [31]:
new_df=pd.concat([df,cd], axis=1)

In [32]:
new_df

   Value 1  Value 2 Value 3  one  two letter
0    100.0    300.0     abc    1    6      a
1    167.0    121.0     xyz    2    7      b
2    234.0    210.5     lmn    3    8      c
3    167.0    210.5     pqr    4    9      d
4      NaN      NaN     NaN    5   10      e

In [33]:
sales={"John":10000,
      "Prathik":5000,
      "Meera":6000,
      "Khan":9000,
      "Ramesh":4000}

In [34]:
sales

{'John': 10000, 'Prathik': 5000, 'Meera': 6000, 'Khan': 9000, 'Ramesh': 4000}

In [35]:
region={"John":"West",
       "Prathik":"East",
      "Meera":"Central",
      "Khan":np.nan,
      "Ramesh":"North",
       "Silesh":"South",
       "Enoch":"East",
       "Binod":"East"}

In [36]:
region

{'John': 'West',
 'Prathik': 'East',
 'Meera': 'Central',
 'Khan': nan,
 'Ramesh': 'North',
 'Silesh': 'South',
 'Enoch': 'East',
 'Binod': 'East'}

In [50]:
sales_df=pd.DataFrame.from_dict(sales,orient="index", columns=["sales"])

In [51]:
sales_df

         sales
John     10000
Prathik   5000
Meera     6000
Khan      9000
Ramesh    4000

In [53]:
region_df=pd.DataFrame.from_dict(region,orient="index",columns=["region"])

In [54]:
region_df

          region
John        West
Prathik     East
Meera    Central
Khan         NaN
Ramesh     North
Silesh     South
Enoch       East
Binod       East

In [56]:
#join: region_df as the left table and sales_df as the right
#based upon the condition, region_df will appear and appear only those items in sales_df

In [60]:
joined_df=region_df.join(sales_df,how="left")

In [61]:
joined_df

          region    sales
John        West  10000.0
Prathik     East   5000.0
Meera    Central   6000.0
Khan         NaN   9000.0
Ramesh     North   4000.0
Silesh     South      NaN
Enoch       East      NaN
Binod       East      NaN

In [62]:
joined_df=region_df.join(sales_df,how="right")

In [64]:
joined_df

          region  sales
John        West  10000
Prathik     East   5000
Meera    Central   6000
Khan         NaN   9000
Ramesh     North   4000

In [65]:
joined_df=region_df.join(sales_df,how="outer")

In [66]:
joined_df

          region    sales
Binod       East      NaN
Enoch       East      NaN
John        West  10000.0
Khan         NaN   9000.0
Meera    Central   6000.0
Prathik     East   5000.0
Ramesh     North   4000.0
Silesh     South      NaN

#merge

In [67]:
region_df.index.name="names"
sales_df.index.name="names"

In [68]:
region_df

          region
names
John        West
Prathik     East
Meera    Central
Khan         NaN
Ramesh     North
Silesh     South
Enoch       East
Binod       East

In [69]:
sales_df

         sales
names
John     10000
Prathik   5000
Meera     6000
Khan      9000
Ramesh    4000

In [71]:
pd.merge(region_df,sales_df,on="names", how="right")

          region  sales
names
John        West  10000
Prathik     East   5000
Meera    Central   6000
Khan         NaN   9000
Ramesh     North   4000